//args - масив от стрингове
function solve(args) {
	//по този начин взимам числото с +го парсвам към число
	//имаме и 3 вида коли i,j,k
    var s = +args[0],
	    i,
	    j,
	    k,
    	count = 0;//за да почне от 0 намерени комбинации първоначално
    	//маркираме колите, които са с 10 колела
    	//i = 0 имаме 0 коли с 10 колела   
    	for(i = 0; i <= s/10; i += 1){
    		//маркираме колите, които са с 4 колела
    		for(j = 0; j <= s/4; j += 1){
    			//маркираме колите, които са с 3 колела
    				for(k = 0; k <= s/3; k += 1){
    						//провери дали i,j,k правят правилната сума
    					if((i * 10 + j * 4 + k * 3) === s){
    						//ако това е изпълнено, означава че сме намерили комбинация 	
    						count += 1;		
    					}
    				}
    		}
    	}
    // може да 
    //console.log(result);
    return count;
}
//дори да имаме 1 число входните данни се подават по този начин
//това число винаги го получаваме като масив с едн елемент и той винаги е стринг      
// console.log(solve(['7']));
// console.log(solve(['10']));
// console.log(solve(['40']));
//как да си направим тест с повече входни данни
var tests = [['7'],
		['10'],
		['40']
		];
tests.forEach(function(test){
		console.log(solve(test));
});		