using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _3.Lover_of_3
{
    class Program
    {
        static void Main(string[] args)
        {
//            Вие се дава поле с размери 6x7, и посоките и се движи:
//• 5 се движи нагоре-НАДЯСНО
//• 2 разиграване десен
//• 3 движи надолу-НАЛЯВО
//• 6 движи по-ляв
//• 5 разиграване десен
//Пешката събира стойности: 0, 6, 12, 18, 24, 24, 18, 12, 12, 12 и 12. Тяхната сума е 150.
//Помогнете Pesho при изчисляване на резултата!
//вход
//Входните данни са дадени в стандартния вход, т.е. конзолата
//На първия ред ще намерите размерите на полето R и C, разделени с един интервал
//На втора линия ще намерите числото п, броят на посоки и движения
//На следващите N реда ще намерите низ D и редица K, разделени с един интервал:
//• D е следващата посока на пешката
//• K е броят на ходове, за да изпълнява в тази посока
//Входът ще бъде валиден, в определен формат, в рамките на ограниченията, посочени по-долу. Не е необходимо да се провери на входните данни изрично.
//продукция
//Печат сумата от клетки, съдържащи се в пътя на шашка
//        }
    }
}
